WsExample03/target/test-classes/Music_List_Request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:mus="http://benchresources.in/entities/music">
	<soapenv:Header />
	<soapenv:Body>
		<mus:MusicListRequestType>
			<mus:composerName>AR Rahman</mus:composerName>
		</mus:MusicListRequestType>
	</soapenv:Body>
</soapenv:Envelope>